1.SQL이란 무엇일까?

1.1 데이터 베이스가 이해할 수 있는 언어

->데이터 베이스 뭐지?
->구조화된 정보 또는 데이터의 조직화된 모음

2. 제 1절 데이터 모델의 이해

2.1 모델링의 이해
->모델링의 정의: 다양한 현상을 표기법에 의해 표기하는 것
->특징 : 추상화,단순화,명확화
->모델링의 3가지 관점: 데이터 관점, 프로세스 관점, 상관 관점

2.2 데이터 모델의 기본 개념 이해
->데이터 모델링의 정의: 정보 시스템을 구축하기 위한 데이터 관점의 업무 분석 기법
->데이터 모델이 제공하는 기능: 시스템 가시화, 시스템 구조와 행동 명세화, 시스템 구축의 구조화된 틀 제공, 문서화 세부 사항은 숨기는 다양한 관점 제공, 상세 수준의 표현방법 제공

2.3 데이터 모델링의 중요성 및 유의점
->중요성: 파급효과, 복잡한 정보 요구사항의 간결한 표현, 데이터 품질
->유의점: 중복 - 데이터 베이스가 여러 장소에 같은 정보를 저장하기 않게함
          비유연성 - 데이터 정의를 데이터 사용 프로세스와 분리
          비일관성 - ex)신용상태에 대한 갱신 없이 고객의 납부이력 정보 갱신

2.4 데이터 모델링의 3단계 진행
->개념적 데이터 모델링: 추상화 수준이 높고 업무 중심적이고 포괄적인 수준의 모델링 진행
->논리적 데이터 모델링: 시스템으로 구축하고자하는 업무에 대해 Key, 속성 관계 등을 정확하게 표현, 높은 재사용
->물리적 데이터 모델링: 실제로 데이터베이스에 이식할 수 있도록 성능, 저장 등 물리적인 성격 고려 설계

2.5 프로젝트 생명주기에서 데이터 모델링
->계획 단계: 개념적 모델링// 분석 단계, 논리적 모델링// 설계 단계, 물리적 모델링
->실제는: 분석 단계에서 개념적+논리적 모델링// 설계 단계, 물리적 모델링

2.6 데이터 모델링에서 데이터 독립성의 이해
가. 데이터 독립성의 필요성: 유지보수 비용 증가, 데이터 복잡도 증가, 데이터 중복성 증가, 요구사항 대응 저하
나. 데이터 베이스 3단계 구조: 외부 단계/ 개념적 단계/ 내부적 단계
다. 데이터 독립성 요소: 외부 스키마/ 개념 스키마/ 내부 스키마
라. 두 영역의 데이터 독립성: 논리적 독립성, 물리적 독립성
마. 사상 'Mapping' 상호 독립적인 개념을 연결 시켜주는 다리/ 외부적,개념적 사상 + 개념적,물리적 사상

2.7 데이터 모델링의 중요한 세가지 개념
가. 데이터 모델링의 세가지 요소
    1)업무가 관여하는 어떤 것(Things)
    2)어떤 것이 가지는 성격(Attibutes)
    3)업무가 관여하는 어떤 것 간의 관계(Relationshups)
나. 단수와 집합(복수)의 명명

      개념                          복집합개념&타입/클래스        개별/단수개념&어커런스/인스턴트
   
  어떤 것(Thing)                   엔터티 타입(Entity Type)               엔터티(Entity)
                                    엔터티(Entity)                인스턴트(Instance), 어커런스(Occurrence)

어떤 것간의 연관(Relationships)       관계(Relationship)                  페어링(Pairing)

어떤 것의 성격(Attributes)             속성(Attribute)                  속성 값(Attribute Value)

2.8 데이터 모델링의 이해관계자
->이해관계자의 데이터 모델링 중요성 인식
->데이터 모델링의 이해관계자

2.9데이터 모델의 표기법인 ERD의 이해
가.데이터 모델 표기법: 엔터티를 사각형으로 표현, 관계를 마름모, 속성을 타원형으로 표현
나.ERD(Entity Reationship Diagram) 표기법을 이용하여 모델링하는 방법
  엔터티 그리기-> 엔터티 배치-> 엔터티간의 관계 설정-> 관계명 기술-> 관계의 참여도 기술-> 관계의 필수여부 기술

2.10 좋은 데이터 모델의 요소

-> 완전성 / 중복배제 / 업무 규칙 / 데이터 재사용 / 의사소통 / 통합성

3. 제 2절 엔터티

3.1 엔터티의 개념: 실제, 객체

3.2 엔터티의 특징:
                 가. 업무에서 필요로 하는 정보
                 나. 식별자에 의해 식별이 가능 해야 함
                 다. 인스턴스의 집합
                 라. 업무프로세스에 의해 이용
                 마. 속성을 포함
                 바. 관계의 존재

3.3 엔터티의 분류:
                 가. 유무형에 따른 분류: 유형 엔터티, 개념 엔터티, 사건 엔터티
                 나. 발생시점에 따른 분류: 기본 엔터티, 중심 엔터티, 행위 엔터티
                 다. 엔터티 분류 방법: 유형(사원,물품), 사건(주문,창구), 개념(조직,장소), 기본/키(사원,부서), 중심(접수,계약), 행위(주문내역, 계약진행)

3.4 엔터티의 명명: 
                 가. 가능하면 약어 사용X
                 나. 현업의 업무 용어 사용, 업무상의 의미를 분명하게
                 다. 모든 엔터티에서 유일한 이름을 부여
                 라. 엔터티가 생성되는 의미대로 자연스럽게 부여

4. 제 3절 속성

4.1 속성의 개념: 업무에서 필요로 하는 인스턴스로 관리하고자 하는 의미상 더이상 분리되지 않는 최소의 데이터 단위

->인스턴스 뭐지? "사용자가 DB에 접근하여 호출/실행을 통해 트랜잭션을 처리 할 수 있는 프로세스와 메모리 영역"

4.2 엔터티, 인스턴스와 속성, 속성값에 대한 내용과 표기법
 가. 엔터티,인스터스,속성,속성값의 관계
 -한 개의 엔터티는 두개 이상의 인스턴스의 집합이어야 한다.
 -한 개의 엔터티는 두개 이상의 속성을 갖는다.
 -한 개의 속성은 한 개의 속성값을 갖는다.
 나. 속성의 표기법: IE표기법, Barker 표기법
 
4.3 속성의 특징: 하나의 속성에는 한 개의 값, 하나의 속성에 여러 개의 값이 있는 다중값일 경우 별도의 엔터티를 이용하여 분리

4.4 속성의 분류
  가. 속성의 특성에 따른 분류: 기본 속성, 설계 속성, 파생 속성
  
  기본-원래 속성, 설계-1:1치환, 파생-계산값
  
  나. 엔터티 구성방식에 따른 분류
      -엔터티를 식별할 수 있는 속성을 PK속성
      -다른 엔터티와의 관계에서 포함된 속성을 FK속성
      -엔터티에 포함되어 있고 PK,FK에 포함되지 않은 속성을 일반 속성이라 한다.
      -또한 의미를 쪼갤 수 있는지에 따라 단순형, 복합형으로 분류할 수 있다.
      -속성 하나에 한 개의 값-> 단일값(Singl value) / 여러개의 값-> 다중값(Multi value)

4.5 도메인: 각 속성이 가질 수 있는 값의 범위
          ->엔터티 내에서 속성에 대한 데이터 타입과 크기 그리고 제약사항을 지정하는 것

5. 제 4절 관계

5.1 관계의 개념
 가. 관계의 정의: 엔터티의 인스턴스 사이의 논리적인 연관성으로서 존재의 형태로서나 행위로서 서로에게 연관성이 부여된 상태
 나. 관계의 페어링: 페어링은 엔터티안에 인스턴스가 개별적으로 관계를 가지는 것 이고, 이것의 집합을 관계로 표현
 다. 관계의 분류: ERD-존재에 의한 관계 / 행위에 의한 관계, UML(Unified Modeling Language)- 연관관계,의존관계


5.2 관계의 표기법
 가. 관계명: 관계의 이름
 나. 관계 차수: 1:1, 1:M, M:N
 다. 관계 선택사양: 필수관계, 선택관계

6. 제 5절 식별자

6.1 식별자 개념
 -하나의 엔터티에 구성되어 있는 여러 개의 속성 중에 엔터티를 대표 할 수 있는 속성을 의미하며
 -하나의 엔터티는 반드시 하나의 유일한 식별자가 존재해야 한다.

6.2 식별자의 특징: 유일성, 최소성, 불변성, 존재성

6.3 식별자 분류 및 표기법
 가. 식별자 분류: 주식별자 보조식별자 / 내부식별자와 외부식별자 / 단일 식별자와 복합식별자 / 본질식별자와 인조식별자

 6.4 주식별자 도출기준
  가. 해당업무에서 자주 이용 되는 속성을 주식별자로 지정하도록 함
  나. 명칭, 내역등과 같이 이름으로 기술되는 것을 피함
  다. 속성의 수가 많아지지 않도록 함

6.5 식별자 관계와 비식별자 관계에 따른 식별자
 가. 식별자관계와 비식별자 관계의 결정: 외부식별자는 Foreign Key역할을 한다
 나. 식별자 관계: 자식엔터티의 주식별자로 부모의 주식별자가 상속이 되는 경우 Null값이 오면 안되므로 반드시 부모엔터티가 생성되어야 자기 자신의 엔터티 생성
 다. 비식별자 관계: 부모 엔터티로부터 속성으로 받았지만 자식엔터티의 주식별자로 사용하지 않고 일반적인 속성으로만 사용하는 경우.
 라. 식별자 관계로만 설정할 경우의 문제점: 주식별자 속성이 지속적으로 증가, 복잡성과 오류 가능성 유발
 마. 비식별자 관계로만 설정한 경우의 문제점: 쓸데없이 부모엔터티까지 찾아가야 하는 경우가 발생한다
 바. 식별자 관계와 비식별자 관계의 모델링: 비식별자 관계 선택 프로세스, 식별자와 비식별자 관계비교, 식별자와 비식별자를 적용한 데이터 모델

 

